zupcorp23012025.Расширение1/src/Documents/ПланыВыручкиПоАптекам/ПланыВыручкиПоАптекам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПланыВыручкиПоАптекам</name>
  <registerRecords>InformationRegister.ПланыВыручкиПоАптекам</registerRecords>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Показатели</name>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>ПланПоВыручкеВсего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПланПоВыручкеОптики</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КабинетВрача</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КТЗБезОптики</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗМЗБезОптики</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗМЗОптики</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

zupcorp23012025.Расширение1/src/Documents/ПланыВыручкиПоАптекам/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ЗаполнитьИзExcel(Команда)
	Значение=ОткрытьФормуМодально("Документ.ПланыВыручкиПоАптекам.Форма.ФормаЗагрузкиИзExcel"); 
	//номера колонок и строк
	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогОткрытияФайла.ПолноеИмяФайла="";
	//Фильтр = "Excel(*.xls)|*.xls|*.ods|*.ods";
	//ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = "Выберите файл"; 
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		ПутьКФайлу =ДиалогОткрытияФайла.ПолноеИмяФайла; 
		//Новый Файл(ДиалогОткрытияФайла.ПолноеИмяФайла);
	Иначе
		Предупреждение(НСтр("ru = 'Файл(ы) не выбран!'; en = 'File(s) not selected!'"));
	КонецЕсли;
	ЗагрузитьОбъектыНаКлиенте(Значение);
	
КонецПроцедуры
&НаКлиенте
Функция ПолучитьДокументОО()
	
	Попытка
		ServiceManager                 = Новый COMОбъект("com.sun.star.ServiceManager");
	Исключение
		Сообщить( "программа OpenOffice\LibreOffice не установлена на данном компьютере!");
		Возврат Неопределено;
	КонецПопытки;
	
	Desktop                            = ServiceManager.createInstance("com.sun.star.frame.Desktop");
	Свойства                           = ServiceManager.Bridge_GetStruct("com.sun.star.beans.PropertyValue");
	Свойства.Name                      = "AsTemplate";
	Свойства.Value                     = Истина;
	Args                               = Новый COMSafeArray("VT_VARIANT", 2);
	Args.SetValue(0, Свойства);
	Свойства1                          = ServiceManager.Bridge_GetStruct("com.sun.star.beans.PropertyValue");
	Свойства1.Name                     = "Hidden";
	Свойства1.Value                    = Истина;
	Args.SetValue(1,Свойства1);
	
	//Приводим файл к виду_
	ПутьКФайлуПрив = СтрЗаменить(ПутьКФайлу," ","%20");
	ПутьКФайлуПрив = СтрЗаменить(ПутьКФайлуПрив,"\","/");
	ПутьКФайлуПрив = "file:/" + "/localhost/" + ПутьКФайлуПрив;
	
	Document                           = Desktop.LoadComponentFromURL(ПутьКФайлуПрив, "_blank", 0, Args);
	
	Возврат Document;
КонецФункции // ПолучитьДокументОО()
&НаКлиенте
Процедура ЗагрузитьОбъектыНаКлиенте(Значение)
	Объект.Показатели.Очистить();
	
	Document                           = ПолучитьДокументОО();	
	Если Document = Неопределено Тогда Возврат КонецЕсли;
	Sheets                             = Document.getSheets();
	Sheet                              = Sheets.getByIndex(1-1);
	
	//СписокКолонок.Очистить();
	//Если СтруктураКолонок.Количество() > 0 Тогда
	//Подразделение="A";
	//ПланПоВыручкеВсего="D";
	//ПланПоВыручкеОптики="E";
	//КабинетВрача="F";
	//КТЗБезОптики="G";
	//ЗМЗБезОптики="H";
	//ЗМЗОптики="I";
	//НомерСтрокиНачало=2;
	//НомерСтрокиКонец=3;
	ТекСтрока = Значение.НомерСтрокиНачало-1;
	Пока ТекСтрока < Значение.НомерСтрокиКонец Цикл
		
		Подразделение = Sheet.GEtCellByPosition(Значение.Подразделение, ТекСтрока).getText().String();
		ПланПоВыручкеВсего = Sheet.GEtCellByPosition(Значение.ПланПоВыручкеВсего, ТекСтрока).getText().String();
		ПланПоВыручкеОптики = Sheet.GEtCellByPosition(Значение.ПланПоВыручкеОптики, ТекСтрока).getText().String();
		КабинетВрача = Sheet.GEtCellByPosition(Значение.КабинетВрача, ТекСтрока).getText().String();
		КТЗБезОптики = Sheet.GEtCellByPosition(Значение.КТЗБезОптики, ТекСтрока).getText().String();
		ЗМЗБезОптики = Sheet.GEtCellByPosition(Значение.ЗМЗБезОптики, ТекСтрока).getText().String();
		ЗМЗОптики = Sheet.GEtCellByPosition(Значение.ЗМЗОптики, ТекСтрока).getText().String();
		
		Если ЗначениеЗаполнено(Подразделение) Тогда
			Парамтеры1=Новый Структура();
			Парамтеры1.Вставить("Подразделение", Подразделение);
			Парамтеры1.Вставить("ПланПоВыручкеВсего", ПланПоВыручкеВсего);
			Парамтеры1.Вставить("ПланПоВыручкеОптики", ПланПоВыручкеОптики);
			Парамтеры1.Вставить("КабинетВрача", КабинетВрача);
			Парамтеры1.Вставить("КТЗБезОптики", КТЗБезОптики);
			Парамтеры1.Вставить("ЗМЗБезОптики", ЗМЗБезОптики);
			Парамтеры1.Вставить("ЗМЗОптики", ЗМЗОптики);			
			
			ЗаполнитьСтрокиНаСервере(Парамтеры1)			
		Иначе
			Сообщить("Подразделение не заполнены в строке - "+Строка(ТекСтрока+1));
		КонецЕсли;
		
		ТекСтрока                  = ТекСтрока + 1;
	КонецЦикла;
	
	Document.close(true);
КонецПроцедуры
Процедура ЗаполнитьСтрокиНаСервере(Параметры1)
	//Получаем Подразделение по коду					
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПодразделенияОрганизацийДополнительныеРеквизиты.Ссылка КАК Ссылка,
	|	ПодразделенияОрганизацийДополнительныеРеквизиты.Значение КАК Код
	|ИЗ
	|	Справочник.ПодразделенияОрганизаций.ДополнительныеРеквизиты КАК ПодразделенияОрганизацийДополнительныеРеквизиты
	|ГДЕ
	|	ПодразделенияОрганизацийДополнительныеРеквизиты.Свойство.Наименование = ""Сокращенное наименование (Подразделения)""
	|	И ПодразделенияОрганизацийДополнительныеРеквизиты.Значение ПОДОБНО &КодАП";
	Запрос.УстановитьПараметр("КодАП",Параметры1.Подразделение+"%");
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ПодразделениеСсылка=Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ПодразделениеСсылка=ВыборкаДетальныеЗаписи.Ссылка;
		КонецЦикла;
		
		Строка=Объект.Показатели.Добавить();
		Строка.Подразделение=ПодразделениеСсылка;
		Строка.ПланПоВыручкеВсего=Число(?(ЗначениеЗаполнено(Параметры1.ПланПоВыручкеВсего),Параметры1.ПланПоВыручкеВсего,0));
		Строка.ПланПоВыручкеОптики=Число(?(ЗначениеЗаполнено(Параметры1.ПланПоВыручкеОптики),Параметры1.ПланПоВыручкеОптики,0));
		Если ЗначениеЗаполнено(Параметры1.КабинетВрача) Тогда
			Если  ВРег(Параметры1.КабинетВрача)="ДА" Тогда
				Строка.КабинетВрача=Истина;
			Иначе
				Строка.КабинетВрача=Ложь;
			КонецЕсли;
		Иначе
			 Строка.КабинетВрача=Ложь;
		КонецЕсли;
		
		Строка.КТЗБезОптики=Число(?(ЗначениеЗаполнено(Параметры1.КТЗБезОптики),Параметры1.КТЗБезОптики,0));
		
		ЗМЗБезОптики=?(ЗначениеЗаполнено(Параметры1.ЗМЗБезОптики),Параметры1.ЗМЗБезОптики,0);
		Строка.ЗМЗБезОптики= Число(СтрЗаменить(ЗМЗБезОптики,"%", ""));
		
		ЗМЗОптики=?(ЗначениеЗаполнено(Параметры1.ЗМЗОптики),Параметры1.ЗМЗОптики,0);
		Строка.ЗМЗОптики=Число(СтрЗаменить(ЗМЗОптики,"%", ""));
	Иначе
			Сообщить("При загрузке данных не найдено подразделение "+Параметры1.Подразделение);
	КонецЕсли;	
		
			
	КонецПроцедуры
&НаКлиенте
Функция ПривестиФайлКУРЛ()
		
		ПутьКФайлуПрив = СтрЗаменить(ПутьКФайлу," ","%20");
		ПутьКФайлуПрив = СтрЗаменить(ПутьКФайлуПрив,"\","/");
		ПутьКФайлуПрив = "file:/" + "/localhost/" + ПутьКФайлуПрив;
		Возврат ПутьКФайлуПрив;
		
	Конецфункции
Функция ИндексКолонкиПоИмени(ИмяКолонки)
		КолСимволовВАлфавите = 26;
		Смещение             = КодСимвола("A", 1);
		КодСим               = КодСимвола(ИмяКолонки, 1);
		ПозСим               = КодСим - Смещение;
		
		Если СтрДлина(ИмяКолонки)=1 Тогда
			Возврат ПозСим;
		КонецЕсли;	
		
		Уровень              = ПозСим + 1;
		КодСим               = КодСимвола(ИмяКолонки, 2);
		ПозСим               = КодСим - Смещение;
		
		Возврат ПозСим + Уровень*КолСимволовВАлфавите;
	КонецФункции
